Repository: GNOME/gdk-pixbuf
Catalog: po/*.po
Languages: kk

source: Failed to open file “%s”: %s
kk: "%s" файлын ашу сәтсіз: %s

source: Image file “%s” contains no data
kk: "%s" сурет файлында деректер жоқ

source: Failed to load animation “%s”: reason not known, probably a corrupt animation file
kk: "%s" анимациясын жүктеу сәтсіз: себебі белгісіз, мүмкін анимация файлы зақымдалған

source: Failed to load image “%s”: reason not known, probably a corrupt image file
kk: "%s" суретін жүктеу сәтсіз: себебі белгісіз, мүмкін сурет файлы зақымдалған

source: Number of Channels
kk: Арналар саны

source: The number of samples per pixel
kk: Пиксельдегі таңдамалар саны

source: Colorspace
kk: Түстер кеңістігі

source: The colorspace in which the samples are interpreted
kk: Таңдамалар интерпретацияланатын түс кеңістігі

source: Has Alpha
kk: Мөлдірлілігі бар

source: Whether the pixbuf has an alpha channel
kk: Пиксельдік буффер ішінде альфа-арнасының бар-жоғы

source: Bits per Sample
kk: Таңдамаға келетін биттер саны

source: The number of bits per sample
kk: Әр таңдамадағы биттер саны

source: Width
kk: Ені

source: The number of columns of the pixbuf
kk: Пиксельдік буффер бағандарының саны

source: Height
kk: Биіктігі

source: The number of rows of the pixbuf
kk: Пиксельдік буффер жолдарының саны

source: Rowstride
kk: Жол қадамы

source: The number of bytes between the start of a row and the start of the next row
kk: Жолдың басы мен келесі жолдың басы арасындағы байттар саны

source: Pixels
kk: Пиксель

source: A pointer to the pixel data of the pixbuf
kk: Пиксельдік буффердің пиксель деректеріне сілтегіш

source: Pixel Bytes
kk: Пиксель байттары

source: Readonly pixel data
kk: Тек оқу үшін пиксель деректері

source: Unable to load image-loading module: %s: %s
kk: Суретті жүктеу модулін жүктеу мүмкін емес: %s: %s

source: Image-loading module %s does not export the proper interface; perhaps it’s from a different gdk-pixbuf version?
kk: %s суретті жүктеу модулі тиісті интерфейсті экспорттамайды; бәлкім, ол басқа gdk-pixbuf нұсқасынан шығар?

source: Image type “%s” is not supported
kk: "%s" суретінің түріне қолдау жоқ

source: Couldn’t recognize the image file format for file “%s”
kk: “%s” файлы үшін сурет файлының пішімін тану мүмкін болмады

source: Unrecognized image file format
kk: Танылмаған сурет файлының пішімі

source: Failed to load image “%s”: %s
kk: "%s" суретін жүктеу сәтсіз аяқталды: %s

source: Error writing to image file: %s
kk: Сурет файлына жазу қатесі: %s

source: This build of gdk-pixbuf does not support saving the image format: %s
kk: gdk-pixbuf бағдарламасының бұл жинағы келесі сурет пішімін сақтауды қолдамайды: %s

source: Insufficient memory to save image to callback
kk: Суретті кері шақыруға сақтау үшін жады жеткіліксіз

source: Failed to open temporary file
kk: Уақытша файлын ашу сәтсіз аяқталды

source: Failed to read from temporary file
kk: Уақытша файлдан оқу сәтсіз аяқталды

source: Failed to open “%s” for writing: %s
kk: Жазу үшін "%s" файлын ашу сәтсіз: %s

source: Failed to close “%s” while writing image, all data may not have been saved: %s
kk: Суретті жазу кезінде “%s” жабу сәтсіз аяқталды, барлық деректер сақталмаған болуы мүмкін: %s

source: Insufficient memory to save image into a buffer
kk: Суретті буферге сақтау үшін жады жеткіліксіз

source: Error writing to image stream
kk: Сурет ағынына жазу қатесі

source: Internal error: Image loader module “%s” failed to complete an operation, but didn’t give a reason for the failure
kk: Ішкі қате: “%s” сурет жүктеу модулі операцияны аяқтай алмады, бірақ сәтсіздіктің себебін көрсетпеді

source: Incremental loading of image type “%s” is not supported
kk: “%s” сурет түрін инкременталды жүктеуге қолдау көрсетілмейді

source: Loop
kk: Цикл

source: Whether the animation should loop when it reaches the end
kk: Анимация соңына жеткенде циклге өтуі керек пе

source: Image header corrupt
kk: Сурет тақырыптамасы зақымдалған

source: Image format unknown
kk: Сурет пішімі белгісіз

source: Image pixel data corrupt
kk: Суреттің пиксель деректері зақымдалған

source: failed to allocate image buffer of %u byte
kk: %u байттық сурет буферін бөлу сәтсіз аяқталды

source: Unexpected icon chunk in animation
kk: Анимациядағы күтпеген таңбаша бөлігі

source: Malformed chunk in animation
kk: Анимациядағы қате пішімделген бөлік

source: Invalid header in animation
kk: Анимациядағы жарамсыз тақырыптама

source: Not enough memory to load animation
kk: Анимацияны жүктеу үшін жады жеткіліксіз

source: ANI image was truncated or incomplete.
kk: ANI суреті қиылған немесе толық емес.

# image format
source: Windows animated cursor
kk: Windows анимацияланған курсоры

source: BMP image has bogus header data
kk: BMP суретінің тақырыптама деректері қате

source: Not enough memory to load bitmap image
kk: Растрлық суретті жүктеу үшін жады жеткіліксіз

source: BMP image has unsupported header size
kk: BMP суретінде қолдау көрсетілмейтін тақырыптама өлшемі бар

source: BMP image has unsupported depth
kk: BMP суретінде қолдау көрсетілмейтін тереңдік бар

source: BMP image has oversize palette
kk: BMP суретінде өлшемі тым үлкен палитра бар

source: Topdown BMP images cannot be compressed
kk: Жоғарыдан төмен бағытталған BMP суреттерін сығу мүмкін емес

source: BMP image width too large
kk: BMP суретінің ені тым үлкен

source: Premature end-of-file encountered
kk: Файлдың соңы күтпеген жерден кездесті

source: Error while decoding colormap
kk: Түстер картасын декодтау кезіндегі қате

source: Image is too wide for BMP format.
kk: Сурет BMP пішімі үшін тым кең.

source: Couldn’t allocate memory for saving BMP file
kk: BMP файлын сақтау үшін жадыны бөлу мүмкін емес

source: Couldn’t write to BMP file
kk: BMP файлына жазу мүмкін емес

# image format
source: Windows icon
kk: Windows таңбашасы

source: JPEG quality must be a value between 0 and 100; value “%s” could not be parsed.
kk: JPEG сапасы 0 мен 100 арасындағы мән болуы тиіс; “%s” мәнін өңдеу мүмкін болмады.

source: JPEG quality must be a value between 0 and 100; value “%d” is not allowed.
kk: JPEG сапасы 0 мен 100 арасындағы мән болуы тиіс; “%d” мәніне рұқсат жоқ.

source: Could not allocate memory: %s
kk: Жадыны бөлу мүмкін емес: %s

source: Could not create stream: %s
kk: Ағынды жасау мүмкін емес: %s

source: Could not seek stream: %s
kk: Ағын бойынша өту мүмкін емес: %s

source: Could not read from stream: %s
kk: Ағыннан оқу мүмкін емес: %s

source: Couldn’t load bitmap
kk: Биттік картаны жүктеу мүмкін болмады

source: Couldn’t load metafile
kk: Метафайлды жүктеу мүмкін болмады

source: Unsupported image format for GDI+
kk: GDI+ үшін қолдау көрсетілмейтін сурет пішімі

source: Couldn’t save
kk: Сақтау мүмкін емес

source: Failure reading GIF: %s
kk: GIF оқу қатесі: %s

source: Not enough memory to load GIF file
kk: GIF файлын жүктеу үшін жады жеткіліксіз

source: GIF image is corrupt (incorrect LZW compression)
kk: GIF суреті зақымдалған (дұрыс емес LZW сығуы)

source: File does not appear to be a GIF file
kk: Файл GIF файлына ұқсамайды

source: Version %s of the GIF file format is not supported
kk: GIF файл пішімінің %s нұсқасына қолдау көрсетілмейді

source: Resulting GIF image has zero size
kk: Шыққан GIF суретінің өлшемі нөлге тең

source: GIF image has no global colormap, and a frame inside it has no local colormap.
kk: GIF суретінде глобалды түстер картасы жоқ, және оның ішіндегі кадрдың жергілікті түстер картасы жоқ.

source: GIF file was missing some data (perhaps it was truncated somehow?)
kk: GIF файлында кейбір деректер жетіспейді (мүмкін ол қандай да бір жолмен қиылған ба?)

source: GIF image was truncated or incomplete.
kk: GIF суреті қиылған немесе толық емес.

source: Not all frames of the GIF image were loaded.
kk: GIF суретінің барлық кадрлары жүктелмеді.

source: Error reading ICNS image: %s
kk: ICNS суретін оқу қатесі: %s

source: Could not decode ICNS file
kk: ICNS файлын декодтау мүмкін болмады

# image format
source: MacOS X icon
kk: MacOS X таңбашасы

source: Invalid header in icon (%s)
kk: Таңбаша тақырыптамасы жарамсыз (%s)

source: Not enough memory to load icon
kk: Таңбашаны жүктеу үшін жады жеткіліксіз

source: Invalid header in icon
kk: Таңбаша тақырыптамасы жарамсыз

source: Compressed icons are not supported
kk: Сығылған таңбашаларға қолдау көрсетілмейді

source: Unsupported icon type
kk: Қолдауы жоқ таңбаша түрі

source: Not enough memory to load ICO file
kk: ICO файлын жүктеу үшін жады жеткіліксіз

source: ICO image was truncated or incomplete.
kk: ICO суреті қиылған немесе толық емес.

source: Image too large to be saved as ICO
kk: Сурет ICO ретінде сақтау үшін тым үлкен

source: Cursor hotspot outside image
kk: Курсордың белсенді аймағы суреттен тыс жерде

source: Unsupported depth for ICO file: %d
kk: ICO файлы үшін қолдау көрсетілмейтін тереңдік: %d

source: Error interpreting JPEG image file (%s)
kk: JPEG сурет файлын талдау қатесі (%s)

source: Insufficient memory to load image, try exiting some applications to free memory
kk: Суретті жүктеу үшін жад жеткіліксіз, жадты босату үшін кейбір қолданбалардан шығып көріңіз

source: Unsupported JPEG color space (%s)
kk: Қолдау көрсетілмейтін JPEG түс кеңістігі (%s)

source: Couldn’t allocate memory for loading JPEG file
kk: JPEG файлын жүктеу үшін жадыны бөлу мүмкін емес

source: Transformed JPEG has zero width or height.
kk: Түрлендірілген JPEG-тің ені немесе биіктігі нөлге тең.

source: Unsupported number of color components (%d)
kk: Түс компоненттерінің қолдау көрсетілмейтін саны (%d)

source: JPEG x-dpi must be a value between 1 and 65535; value “%s” is not allowed.
kk: JPEG x-dpi мәні 1 мен 65535 арасында болуы тиіс; “%s” мәніне рұқсат етілмейді.

source: JPEG y-dpi must be a value between 1 and 65535; value “%s” is not allowed.
kk: JPEG y-dpi мәні 1 мен 65535 арасында болуы тиіс; “%s” мәніне рұқсат етілмейді.

source: Color profile has invalid length “%u”.
kk: Түс профилінің ұзындығы “%u” жарамсыз.

source: Bits per channel of PNG image is invalid.
kk: PNG суретінің арнасына келетін биттер саны жарамсыз.

source: Transformed PNG has zero width or height.
kk: Түрлендірілген PNG-дің ені немесе биіктігі нөлге тең.

source: Bits per channel of transformed PNG is not 8.
kk: Түрлендірілген PNG-дің арнасына келетін биттер саны 8-ге тең емес.

source: Transformed PNG not RGB or RGBA.
kk: Түрлендірілген PNG RGB немесе RGBA емес.

source: Transformed PNG has unsupported number of channels, must be 3 or 4.
kk: Түрлендірілген PNG-дің арналар санына қолдау көрсетілмейді, 3 немесе 4 болуы тиіс.

source: Fatal error in PNG image file: %s
kk: PNG сурет файлындағы қатаң қате: %s

source: Insufficient memory to load PNG file
kk: PNG сурет файлын жүктеу үшін жады жетпейді

source: Couldn’t allocate memory for loading PNG
kk: PNG файлын жүктеу үшін жадыны бөлу мүмкін емес

source: Insufficient memory to store a %lu by %lu image; try exiting some applications to reduce memory usage
kk: %lu x %lu суретін сақтау үшін жады жеткіліксіз; жады қолданысын азайту үшін кейбір қолданбалардан шығып көріңіз

source: Fatal error reading PNG image file
kk: PNG сурет файлын оқу кезіндегі түзетілмейтін қате

source: Fatal error reading PNG image file: %s
kk: PNG сурет файлын оқу кезіндегі түзетілмейтін қате: %s

source: Invalid key “%s”. Keys for PNG text chunks must have at least 1 and at most 79 characters.
kk: «%s» кілті жарамсыз. PNG мәтіндік блоктарына арналған кілттер 1-ден 79 таңбаға дейін болуы тиіс.

source: Invalid key “%s”. Keys for PNG text chunks must be ASCII characters.
kk: «%s» кілті жарамсыз. PNG мәтіндік блоктарына арналған кілттер ASCII таңбалары болуы тиіс.

source: Value for PNG text chunk '%s' cannot be converted to ISO-8859-1 encoding.
kk: '%s' PNG мәтіндік блогының мәнін ISO-8859-1 кодталуына түрлендіру мүмкін емес.

source: Color profile has invalid length %d
kk: Түс профилінің %d ұзындығы жарамсыз

source: PNG compression level must be a value between 0 and 9; value “%s” is invalid
kk: PNG сығу деңгейі 0 мен 9 арасындағы мән болуы тиіс; «%s» мәні жарамсыз

source: PNG %s must be greater than zero; value “%s” is not allowed
kk: PNG %s нөлден үлкен болуы тиіс; «%s» мәніне рұқсат жоқ

source: PNM loader expected to find an integer, but didn’t
kk: PNM жүктеушісі бүтін санды күткен болатын, бірақ таба алмады

source: PNM file has an incorrect initial byte
kk: PNM файлының бастапқы байты қате

source: PNM file is not in a recognized PNM subformat
kk: PNM файлы танылған PNM ішкі пішімінде емес

source: PNM file has an invalid width
kk: PNM файлының ені жарамсыз

source: PNM file has an image width of 0
kk: PNM файлындағы сурет ені 0-ге тең

source: PNM file has an invalid height
kk: PNM файлының биіктігі жарамсыз

source: PNM file has an image height of 0
kk: PNM файлындағы сурет биіктігі 0-ге тең

source: Maximum color value in PNM file is 0
kk: PNM файлындағы максималды түс мәні 0-ге тең

source: Maximum color value in PNM file is too large
kk: PNM файлындағы максималды түс мәні тым үлкен

source: Raw PNM image type is invalid
kk: Шикі PNM сурет түрі жарамсыз

source: PNM image loader does not support this PNM subformat
kk: PNM сурет жүктеушісі бұл PNM ішкі пішімін қолдамайды

source: Raw PNM formats require exactly one whitespace before sample data
kk: Шикі PNM пішімдері мәліметтер үлгісінің алдында дәл бір бос орынды талап етеді

source: Cannot allocate memory for loading PNM image
kk: PNM суретін жүктеу үшін жады бөлу мүмкін емес

source: Insufficient memory to load PNM context struct
kk: PNM контекст құрылымын жүктеу үшін жады жеткіліксіз

source: Unexpected end of PNM image data
kk: PNM сурет мәліметтерінің күтпеген соңы

source: Insufficient memory to load PNM file
kk: PNM сурет файлын жүктеу үшін жады жетпейді

source: Input file descriptor is NULL.
kk: Кіріс файл дескрипторы NULL болып тұр.

source: Failed to read QTIF header
kk: QTIF тақырыптамасын оқу сәтсіз аяқталды

source: QTIF atom size too large (%d byte)
kk: QTIF атомының өлшемі тым үлкен (%d байт)

source: Failed to allocate %d byte for file read buffer
kk: Файлды оқу буфері үшін %d байт бөлу сәтсіз аяқталды

source: File error when reading QTIF atom: %s
kk: QTIF атомын оқу кезінде файл қатесі: %s

source: Failed to skip the next %d byte with seek().
kk: Келесі %d байтты seek() арқылы өткізіп жіберу сәтсіз аяқталды.

source: Failed to allocate QTIF context structure.
kk: QTIF контекст құрылымын бөлу сәтсіз аяқталды.

source: Failed to create GdkPixbufLoader object.
kk: GdkPixbufLoader объектісін жасау сәтсіз аяқталды.

source: Failed to find an image data atom.
kk: Сурет деректерінің атомын табу сәтсіз аяқталды.

source: Cannot allocate colormap
kk: Түстер картасын жаңадан бөлу мүмкін емес

source: Cannot allocate new pixbuf
kk: Жаңа пиксельдік буфферді жаңадан бөлу мүмкін емес

source: Unexpected bitdepth for colormap entries
kk: Түстер картасы жазбалары үшін күтілмеген биттік тереңдік

source: Pseudocolor image does not contain a colormap
kk: Псевдотүсті суретте түстер картасы жоқ

source: Cannot allocate TGA header memory
kk: TGA тақырыптамасы үшін жады бөлу мүмкін емес

source: TGA image has invalid dimensions
kk: TGA суретінің өлшемдері жарамсыз

source: TGA image type not supported
kk: TGA суретінің түріне қолдау жоқ

source: Cannot allocate memory for TGA context struct
kk: TGA контекст құрылымы үшін жад бөлу мүмкін емес

source: TGA image was truncated or incomplete.
kk: TGA суреті қиылған немесе толық емес.

source: Could not get image width (bad TIFF file)
kk: Сурет енін алу мүмкін болмады (нашар TIFF файлы)

source: Could not get image height (bad TIFF file)
kk: Сурет биіктігін алу мүмкін болмады (нашар TIFF файлы)

source: Width or height of TIFF image is zero
kk: TIFF суретінің ені немесе биіктігі нөлге тең

source: Dimensions of TIFF image too large
kk: TIFF суретінің өлшемдері тым үлкен

source: Insufficient memory to open TIFF file
kk: TIFF сурет файлын жүктеу үшін жады жетпейді

source: Failed to load RGB data from TIFF file
kk: TIFF файлынан RGB деректерін жүктеу сәтсіз аяқталды

source: Failed to open TIFF image
kk: TIFF суретін ашу сәтсіз аяқталды

source: Failed to load TIFF image
kk: TIFF суретін жүктеу сәтсіз аяқталды

source: Failed to save TIFF image
kk: TIFF суретін сақтау сәтсіз аяқталды

source: TIFF compression doesn’t refer to a valid codec.
kk: TIFF сығуы жарамды кодекке сілтеп тұрған жоқ.

source: Color profile has invalid length %d.
kk: Түс профилінің ұзындығы %d жарамсыз.

source: TIFF bits-per-sample doesn’t contain a supported value.
kk: TIFF bits-per-sample параметрінде қолдау көрсетілетін мән жоқ.

source: Failed to write TIFF data
kk: TIFF деректерін жазу сәтсіз аяқталды

source: TIFF x-dpi must be greater than zero; value “%s” is not allowed.
kk: TIFF x-dpi нөлден үлкен болуы тиіс; “%s” мәніне рұқсат етілмейді.

source: TIFF y-dpi must be greater than zero; value “%s” is not allowed.
kk: TIFF y-dpi нөлден үлкен болуы тиіс; “%s” мәніне рұқсат етілмейді.

source: Couldn’t write to TIFF file
kk: TIFF файлына жазу мүмкін емес

source: Invalid XBM file
kk: XBM файлы жарамсыз

source: Insufficient memory to load XBM image file
kk: XBM сурет файлын жүктеу үшін жады жетпейді

source: Failed to write to temporary file when loading XBM image
kk: XBM суретін жүктеу кезінде уақытша файлға жазу қатемен аяқталды

source: No XPM header found
kk: XPM тақырыптамасы табылмады

source: Invalid XPM header
kk: XPM тақырыптамасы жарамсыз

source: XPM file has image width <= 0
kk: XPM файлындағы сурет ені <= 0

source: XPM file has image height <= 0
kk: XPM файлындағы сурет биіктігі <= 0

source: XPM has invalid number of chars per pixel
kk: XPM-де пиксельге шаққандағы таңбалар саны жарамсыз

source: XPM file has invalid number of colors
kk: XPM файлындағы түстер саны жарамсыз

source: Cannot allocate memory for loading XPM image
kk: XPM сурет файлын жүктеу үшін жады бөлу мүмкін емес

source: Cannot read XPM colormap
kk: XPM түс картасы оқылмады

source: Dimensions do not match data
kk: Өлшемдер деректерге сәйкес келмейді

source: Failed to write to temporary file when loading XPM image
kk: XPM суретін жүктеу кезінде уақытша файлға жазу қатемен аяқталды
